from main import otm_function, mtm_function, set_a

#TDD-фреймворк
def test_otm_function():
    expected = [('Глава 1', 250, 'Капитанская дочка'), ('Глава 2', 350, 'Ася'), ('Глава 3', 450, 'Крыжовник'),
                ('Глава 2', 350, 'Ася'), ('Глава 4', 250, 'Капитанская дочка'), ('Глава 5', 200, 'Собачье сердце')]
    actual = []
    assert otm_function(actual) == expected


def test_mtm_function():
    expected = [('Глава 1', 250, 'Документ Финансист'), ('Глава 5', 350, 'Документ Финансист'), ('Глава 2', 450, 'Ася'),
                ('Глава 2', 350, 'Собачье сердце'), ('Глава 1', 350, 'Ася'), ('Глава 5', 450, 'Документ Лабораторная работа'),
                ('Глава 3', 250, 'Ася'), ('Глава 2', 200, 'Собачье сердце'), ('Глава 4', 350, 'Документ Лабораторная работа'),
                ('Глава 4', 200, 'Собачье сердце'), ('Глава 3', 350, 'Ася'), ('Глава 1', 250, 'Ася')]
    actual = []
    assert mtm_function(actual) == expected


def test_set_a():
    expected = {'Глава 2': ['Документ Финансист', 'Собачье сердце'], 'Глава 3': ['Собачье сердце', 'Документ Финансист']}
    m_to_m = []
    res = {}
    actual = set_a(mtm_function(m_to_m), res)
    assert expected == actual
